Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: This directory holds the final output images generated for the target system, such as filesystem images, kernel images, or bootloader images.
it_it: Questa directory contiene le immagini di output finali generate per il sistema target, come immagini del file system, immagini del kernel o immagini del bootloader.

source: This directory is located within the TMPDIR directory structure and is specific to the recipe being built and the system for which it is being built.
it_it: Questa directory si trova all'interno della struttura di directory TMPDIR ed è specifica della ricetta in fase di compilazione e del sistema per cui viene compilata.

source: This disables the repeat feature so the button will not be activated upon leaving edit mode.
it_it: In questo modo la funzione di ripetizione viene disattivata, quindi il pulsante non verrà attivato quando si esce dalla modalità di modifica.

source: This does not impact your Animation template.
it_it: Ciò non influisce sul template dell'Animazione

source: This driver assumes an existing OpenGL context and generates textures with hardware acceleration for integration into custom graphics pipelines.
it_it: Questo driver presuppone un contesto OpenGL esistente e genera texture con accelerazione hardware per l'integrazione in pipeline grafiche personalizzate.

source: This driver creates an LVGL display which is only concerned with a specific layer of the LTDC peripheral, meaning two LVGL LTDC displays can be created and operate independently on the separate layers.
it_it: Questo driver crea un display LVGL che si occupa solo di uno specifico layer della periferica LTDC, il che significa che è possibile creare due display LVGL LTDC che operano indipendentemente sui rispettivi layer.

source: This driver provides lower-level hardware integration with direct driver access, supporting both DRM-based systems and standalone implementations for embedded platforms.
it_it: Questo driver fornisce l'integrazione hardware di basso livello con accesso diretto al driver, supportando sia sistemi basati su DRM che implementazioni 'standalone' per piattaforme embedded.

source: This driver relies on code generated by e\ |sup2| studio.
it_it: Questo driver si basa sul codice generato da e\ |sup2| studio.

source: This driver relies on the presence of the MCUx SDK from NXP in the same project
it_it: Questo driver si basa sulla presenza dell'SDK MCUx di NXP nello stesso progetto.

source: This enables the drawing logic to have a very low RAM footprint because the pixels are extracted directly from the file similar to how they are extracted from BMP files.
it_it: Questo consente alla "drawing logic" [logica di disegno] di occupare una quantità di RAM molto ridotta, poiché i pixel vengono estratti direttamente dal file, in modo simile a come vengono estratti dai file BMP.

source: This enables the inclusion of symbols and directories with lower complexity.
it_it: Ciò consente l'inclusione di simboli e directory con una minore complessità.

source: This ensures that the build uses a consistent version of the code.
it_it: Questo garantisce che la build utilizzi una versione coerente del codice.

source: This ensures that the width and height of the redrawn area are always multiples of 8.
it_it: Questo garantisce che la larghezza e l'altezza dell'area ridisegnata siano sempre multipli di 8.

source: This event callback will be called every time the node properties change.
it_it: Questa callback di evento verrà chiamata ogni volta che le proprietà dei nodi cambiano.

source: This example configuration results in going to the pressed state quickly and then going back to default slowly.
it_it: Questa configurazione di esempio comporta un rapido passaggio allo stato premuto e un lento ritorno allo stato di default.

source: This example illustrates a screen in XML.
it_it: Questo esempio illustra una schermata in XML.

source: This example rotates labels by 20 degrees: :cpp:expr:`lv_obj_set_style_transform_rotation(scale, 200, LV_PART_INDICATOR)`.
it_it: Questo esempio ruota le etichette di 20 gradi: :cpp:expr:`lv_obj_set_style_transform_rotation(scale, 200, LV_PART_INDICATOR)`.

source: This example shows how to read a directory's content.
it_it: Questo esempio mostra come leggere il contenuto di una directory.

source: This example shows how to set the "default" theme:
it_it: Questo esempio mostra come impostare il tema di "default":

source: This feature can be enabled by the :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ONE` flag.
it_it: Questa funzionalità può essere abilitata tramite il flag :cpp:enumerator:`LV_OBJ_FLAG_SCROLL_ONE`.

source: This feature can be enabled in the style by setting ``img_recolor_opa`` between :cpp:enumerator:`LV_OPA_TRANSP` (no recolor, value: 0) and :cpp:enumerator:`LV_OPA_COVER` (full recolor, value: 255).
it_it: Questa funzionalità può essere abilitata nello stile impostando ``img_recolor_opa`` tra :cpp:enumerator:`LV_OPA_TRANSP` (nessuna ricolorazione, valore: 0) e :cpp:enumerator:`LV_OPA_COVER` (ricolorazione completa, valore: 255).

source: This feature can be enabled individually for each label by :cpp:expr:`lv_label_set_recolor(label, en)` function.
it_it: Questa funzionalità può essere abilitata individualmente per ogni etichetta tramite la funzione :cpp:expr:`lv_label_set_recolor(label, en)`.

source: This feature is currently experimental, there are clipping issues especially when using large font sizes.
it_it: Questa funzionalità è attualmente sperimentale e presenta problemi di clipping, soprattutto quando si utilizzano font di grandi dimensioni.

source: This feature is enabled by adding the :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST` flag: :cpp:expr:`lv_obj_add_flag(slider, LV_OBJ_FLAG_ADV_HITTEST)`.
it_it: Questa funzione si attiva aggiungendo il flag :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST`: :cpp:expr:`lv_obj_add_flag(slider, LV_OBJ_FLAG_ADV_HITTEST)`.

source: This feature is experimental and the API is private.
it_it: Questa funzionalità è sperimentale e l'API è privata.

source: This field must be provided when registering the function pointer, and provided to the callback function itself.
it_it: Questo campo deve essere specificato durante la registrazione del puntatore alla funzione e fornito alla funzione di callback stessa.

source: This file also provides a template for new file-system drivers you can use if the one you need is not already provided.
it_it: Questo file fornisce anche un template per i nuovi driver del file system che è possibile utilizzare se quello necessario non è già disponibile.

source: This file exists only to be compatible with Arduino's library structure
it_it: Questo file esiste solo per essere compatibile con la struttura della libreria di Arduino

source: This folder contains the final output artifacts that are ready for deployment.
it_it: Questa cartella contiene gli artefatti di output finali pronti per il "deployment" [distribuzione].

source: This folder contains the intermediate files and build artifacts for the various packages that are being compiled.
it_it: Questa cartella contiene i file intermedi e gli artefatti della build per i vari pacchetti in fase di compilazione.

source: This folder is a modular approach introduced in Yocto to handle sysroots.
it_it: Questa cartella rappresenta un approccio modulare introdotto in Yocto per la gestione delle sysroot.

source: This folder is very important and helps a lot during debug phases.
it_it: Questa cartella è molto importante e di grande aiuto durante le fasi di debug.

source: This function (whether provided by LVGL or by you --- more on this below) is responsible for assigning a value to the Widget's ``id`` field, and possibly do other things, depending on the implementation.
it_it: Questa funzione (fornita da LVGL o in proprio --- maggiori dettagli di seguito) è responsabile dell'assegnazione di un valore al campo ``id`` del Widget e, a seconda dell'implementazione, può svolgere anche altre funzioni.

source: This function (whether provided by LVGL or by you --- more on this below) is responsible for doing the clean-up of any resources allocated by :cpp:func:`lv_obj_assign_id`
it_it: Questa funzione (fornita da LVGL o in proprio --- maggiori dettagli di seguito) è responsabile della pulizia di tutte le risorse allocate da :cpp:func:`lv_obj_assign_id`

source: This function calculates the height with the current style.
it_it: Questa funzione calcola l'altezza con lo stile corrente.

source: This function can be called before :cpp:func:`lv_gif_set_src` to prevent the initial default ARGB8888 framebuffer from being allocated.
it_it: Questa funzione può essere chiamata prima di :cpp:func:`lv_gif_set_src` per impedire l'allocazione del framebuffer ARGB8888 iniziale di default.

source: This function may be useful to load a font from an external file system, which is not supported by LVGL.
it_it: Questa funzione può essere utile per caricare un font da un file system esterno, non supportato da LVGL.

source: This function returns a Boolean value indicating whether any *live, running* Animations were deleted.
it_it: Questa funzione restituisce un valore Booleano che indica se sono state eliminate Animazioni *live, running*.

source: This function returns a pointer to that object.
it_it: Questa funzione restituisce un puntatore a tale oggetto.

source: This function returns a pointer to the button created, which you can use to, for example, add an event call-back.
it_it: Questa funzione restituisce un puntatore al pulsante creato, utilizzabile, ad esempio, per aggiungere una callback di evento.

source: This function returns a pointer to the label created, which you can use to, for example, change its text with one of the ``lv_label_set_text...()`` functions.
it_it: Questa funzione restituisce un puntatore all'etichetta creata, utilizzabile, ad esempio, per modificarne il testo con una delle funzioni ``lv_label_set_text...()``.

source: This function returns a pointer to the newly-created Observer.
it_it: Questa funzione restituisce un puntatore all'Observer appena creato.

source: This function should be used when the pointer *does not* point to a Widget.
it_it: Questa funzione dovrebbe essere utilizzata quando il puntatore *non* punta a un Widget.

source: This function will copy the contents of the structure itself.
it_it: Questa funzione copierà il contenuto della struttura stessa.

source: This function will only replace ``old_style`` with ``new_style`` if the ``selector`` matches the ``selector`` used in :cpp:func:`lv_obj_add_style`.
it_it: Questa funzione sostituirà ``old_style`` con ``new_style`` se il ``selector`` corrisponde al ``selector`` utilizzato in :cpp:func:`lv_obj_add_style`.

source: This function will remove ``style`` only if the ``selector`` matches with the ``selector`` used in :cpp:func:`lv_obj_add_style`.
it_it: Questa funzione rimuoverà ``style`` solo se il ``selector`` corrisponde al ``selector`` utilizzato in :cpp:func:`lv_obj_add_style`.

source: This function works in a practical way:
it_it: Questa funzione ha un funzionamento pratico:

source: This gives 0.1-degree resolution.
it_it: Questo fornisce una risoluzione di 0,1 gradi.

source: This goes well with `CircuitPython vision <https://learn.adafruit.com/welcome-to-circuitpython/what-is-circuitpython>`__.
it_it: Questo si integra perfettamente con la `visione di CircuitPython <https://learn.adafruit.com/welcome-to-circuitpython/what-is-circuitpython>`__.

source: This guide explains how to create a docker image containing LVGL and a simple demo application that can be deployed on any Toradex device running TorizonOS.
it_it: Questa guida spiega come creare un'immagine Docker contenente LVGL e una semplice applicazione demo che può essere distribuita su qualsiasi dispositivo Toradex con TorizonOS.

source: This guide explains how to perform those operations manually.
it_it: Questa guida spiega come eseguire manualmente queste operazioni.

source: This guide explains how to properly integrate your LVGL Editor exported project into an Arduino sketch, why it must go inside the src folder, and how to fix include paths for successful compilation.
it_it: Questa guida spiega come integrare correttamente il progetto esportato da LVGL Editor in uno sketch Arduino, perché deve essere inserito nella cartella src e come correggere i path di inclusione per una compilazione corretta.

source: This guide is for Linux and Windows.
it_it: Questa guida è per Linux e Windows.

source: This guide was done on ``Ubuntu 22.04``
it_it: Questa guida è stata realizzata su ``Ubuntu 22.04``

source: This guide will cover the usage of the LVGL using the Espressif-IDF software development kit.
it_it: Questa guida illustrerà l'utilizzo di LVGL utilizzando il kit di sviluppo software Espressif-IDF.

source: This handles all the LVGL-related tasks:
it_it: Questo comando gestisce tutte le attività relative a LVGL:

source: This happens as a result of a refresh :ref:`timer` created that gets created when the display is created, and is executed at that interval.
it_it: Ciò avviene a seguito di un :ref:`timer` di aggiornamento creato al momento della creazione del display ed eseguito a quell'intervallo.

source: This happens because PPA only accepts chunks of data that are aligned to the cache L1 line size, that is it 64-bytes, even though the PPA draw unit handles the alignment of the source buffer, the target draw buffer area should be also aligned otherwise the transfer from PPA to it may fail.
it_it: Questo accade perché PPA accetta solo blocchi di dati allineati alla dimensione della linea L1 della cache, ovvero 64 byte. Sebbene l'unità di disegno PPA gestisca l'allineamento del buffer sorgente, anche l'area del buffer di disegno target deve essere allineata, altrimenti il ​​trasferimento da PPA a quest'ultimo potrebbe non riuscire.

source: This has interesting implications, especially since the programming environment is as low-level as Arduino.
it_it: Ciò ha implicazioni interessanti, soprattutto perché l'ambiente di programmazione è di basso livello come Arduino.

source: This helps maintain a clean Buildroot directory.
it_it: Questo aiuta a mantenere pulita la directory Buildroot.

source: This helps to ensure the integrity of the license file included in the package.
it_it: Questo aiuta a garantire l'integrità del file di licenza incluso nel pacchetto.

source: This identifier is merely a way for the LVGL File System abstraction logic to look up the appropriate registered file-system driver for a given path.
it_it: Questo identificativo è semplicemente un modo per la logica di astrazione del file system LVGL di cercare il driver del file system registrato appropriato per un determinato percorso.

source: This implementation consists of:
it_it: Questa implementazione è composta da:

source: This includes Single-board computers like the Raspberry Pi
it_it: Questo include computer Single-board come il Raspberry Pi

source: This includes any kind of touchpad or mouse.
it_it: Questa categoria include qualsiasi tipo di touchpad o mouse.

source: This includes calls to :cpp:func:`lv_timer_handler`.
it_it: Questo include le chiamate a :cpp:func:`lv_timer_handler`.

source: This includes images and fonts stored in memory, subjects and constants provided by the application, and most importantly, event callbacks.
it_it: Tra questi rientrano immagini e font memorizzati in memoria, argomenti e costanti forniti dall'applicazione e, soprattutto, le callback degli eventi.

source: This includes subscriptions made using any of the :ref:`observer_widget_binding` functions covered below.
it_it: Ciò include le sottoscrizioni effettuate utilizzando una qualsiasi delle funzioni :ref:`observer_widget_binding` descritte di seguito.

source: This includes the necessary tools, libraries, and headers to build applications that run on the target device.
it_it: Questo include gli strumenti, le librerie e gli header necessari per creare applicazioni eseguibili sul dispositivo target.

source: This includes the root filesystem and any additional files that will be included in the target environment.
it_it: Questo include il file system di root e qualsiasi file aggiuntivo che verrà incluso nell'ambiente di destinazione.

source: This includes tools and utilities that are needed to build packages or to run the build system itself.
it_it: Include strumenti e utilità necessari per compilare i pacchetti o per eseguire il sistema di build stesso.

source: This includes touch, mouse, cursor, keyboard, external buttons, encoder, navigation, and many more.
it_it: Tra questi rientrano touch, mouse, cursore, tastiera, pulsanti esterni, encoder, navigazione e molti altri.

source: This includes:
it_it: Questo include:

source: This information includes the location from which to download the unaltered source, any source patches to be applied to that source (if needed), which special configuration options to apply, how to compile the source files, and how to package the compiled output.
it_it: Queste informazioni includono la posizione da cui scaricare il codice sorgente non modificato, eventuali patch da applicare a tale codice sorgente (se necessario), quali opzioni di configurazione speciali applicare, come compilare i file sorgente e come pacchettizzare l'output compilato.

source: This involves complex matrix calculations during the rendering phase which will impact performance:
it_it: Ciò comporta calcoli complessi di matrice durante la fase di rendering che influiranno sulle prestazioni:

source: This is a convenient way to share developed UIs with stakeholders, as they can test the interface without needing a developer setup.
it_it: Questo è un modo pratico per condividere le interfacce utente sviluppate con gli stakeholder, poiché possono testarle senza dover configurare un programma di sviluppo.

source: This is a file that normally has the extension ``.ld``.
it_it: Questo è un file che normalmente ha l'estensione ``.ld``.

source: This is a form of compression that does not require a decompression step.
it_it: Si tratta di una forma di compressione che non richiede una fase di decompressione.

source: This is a generic VG-Lite rendering backend implementation that is designed to utilize `VeriSilicon <https://verisilicon.com/>`_'s generic API to operate GPU hardware as much as possible.
it_it: Si tratta di un'implementazione generica del backend di rendering VG-Lite, progettata per utilizzare l'API generica di `VeriSilicon <https://verisilicon.com/>`_ per gestire l'hardware GPU il più possibile.

source: This is a guide for getting started with LVGL on an Alif board.
it_it: Questa è una guida per iniziare a usare LVGL su una scheda Alif.

source: This is a optional steps, executes if compilation is available.
it_it: Questo è un passaggio facoltativo, eseguito se la compilazione è disponibile.

source: This is a optional steps, executes if configuration is available.
it_it: Questo è un passaggio facoltativo, eseguito se disponibile.

source: This is a simple example of both load and create:
it_it: Questo è un semplice esempio di load e create:

source: This is achieved by setting the style attributes with the :cpp:func:`lv_style_set_text_outline_width` and :cpp:func:`lv_style_set_text_outline_color` functions
it_it: Ciò si ottiene impostando gli attributi di stile con le funzioni :cpp:func:`lv_style_set_text_outline_width` e :cpp:func:`lv_style_set_text_outline_color`

source: This is an example to initialize an encoder:
it_it: Questo è un esempio di inizializzazione di un encoder:

source: This is an x86 panel PC which you can program using the Arduino IDE.
it_it: Questo è un panel PC x86 programmabile tramite l'IDE Arduino.

source: This is as simple as swapping :cpp:expr:`lv_alloc/lv_realloc` calls in `lv_rlottie.c`` with :cpp:expr:`heap_caps_malloc` (for IDF) with the appropriate :cpp:expr:`MALLOC_CAP` call --- for SPIRAM usage this is :cpp:expr:`MALLOC_CAP_SPIRAM`.
it_it: È semplice come scambiare le chiamate :cpp:expr:`lv_alloc/lv_realloc` in `lv_rlottie.c`` con :cpp:expr:`heap_caps_malloc` (per IDF) con la chiamata :cpp:expr:`MALLOC_CAP` appropriata --- per l'utilizzo di SPIRAM questa è :cpp:expr:`MALLOC_CAP_SPIRAM`.

source: This is because there is no practical difference between how uncompressed BMP files and LVGL's image format store the image data.
it_it: Questo perché non esiste alcuna differenza pratica tra il modo in cui i file BMP non compressi e il formato immagine di LVGL con si memorizzano i dati dell'immagine.

source: This is called automatically when registering a new test, so manual calls are usually unnecessary.
it_it: Questo metodo viene richiamato automaticamente quando si registra un nuovo test, quindi, le chiamate manuali sono solitamente superflue.

source: This is covered below.
it_it: Questo argomento è trattato di seguito.

source: This is done so that bindings that generate code automatically will have an easy way to collect the needed information without having to reinvent the wheel.
it_it: Questo viene fatto in modo che i binding che generano codice automaticamente possano raccogliere facilmente le informazioni necessarie senza dover reinventare la ruota.

source: This is especially handy if you have only a few buttons available, or you want to use other buttons in addition to an encoder wheel.
it_it: Questo è particolarmente utile se si hanno a disposizione solo pochi pulsanti o per utilizzarne altri oltre alla rotellina dell'encoder.

source: This is essential for embedded systems, where development often occurs on more powerful machines.
it_it: Questo è essenziale per i sistemi embedded, dove lo sviluppo avviene spesso su macchine più potenti.

source: This is essential for:
it_it: Questo è essenziale per:

source: This is handled via the ``dispatch_cb`` of the Draw Units.
it_it: Questo viene gestito tramite ``dispatch_cb`` delle Draw Unit.

source: This is identical to how ``<component>``\ s are structured.
it_it: Questo è identico alla struttura dei ``<component>``.

source: This is just a brief example of how to add LVGL to a new project.
it_it: Questo è solo un breve esempio di come aggiungere LVGL a un nuovo progetto.

source: This is much like in CSS when used classes are listed like ``<div class=".btn .btn-red">``.
it_it: Questo è molto simile a quello dei CSS, quando le classi utilizzate sono elencate come ``<div class=".btn .btn-red">``.

source: This is necessary because LVGL reserves 2 x 4 bytes in the buffer, as these are assumed to be used as a palette.
it_it: Questo è necessario perché LVGL riserva 2 x 4 byte nel buffer, poiché si presume che questi vengano utilizzati come palette.

source: This is not supported for Components.
it_it: Questa funzionalità non è supportata per i Componenti.

source: This is not the case with :cpp:func:`lv_label_set_text_static`.
it_it: Questo non avviene con :cpp:func:`lv_label_set_text_static`.

source: This is often used to display Unicode emoji icons in text.
it_it: Questo viene spesso utilizzato per visualizzare le icone emoji Unicode nel testo.

source: This is only going to be seen in the ``"type"`` element of a ``"function"`` type.
it_it: Questo verrà visualizzato solo nell'elemento ``"type"`` di un tipo ``"function"``.

source: This is optional task, executes if patch is available.
it_it: Questo è un task facoltativo, eseguito se la patch è disponibile.

source: This is represented as :cpp:expr:`LV_STATE_FOCUSED | LV_STATE_PRESSED`.
it_it: Questo è rappresentato come :cpp:expr:`LV_STATE_FOCUSED | LV_STATE_PRESSED`.

source: This is required to make LVGL recognize the Component by name.
it_it: Ciò è necessario affinché LVGL riconosca il Componente per nome.
